tutorials/lagrangian/reactingParcelFoam/counterFlowFlame2DLTS/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1.18001;

boundaryField
{
    fuel
    {
        type            calculated;
        value           uniform 0.243121;
    }
    air
    {
        type            calculated;
        value           uniform 0.438564;
    }
    outlet
    {
        type            calculated;
        value           uniform 1.18001;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
